# IFCFileModelOptions Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCFileModelOptions Class
Members See Also
---
This class contains options to create an IFC file model.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class IFCFileModelOptions : IDisposable
```

Visual Basic
---
```text
Public Class IFCFileModelOptions _
	Implements IDisposable
```

Visual C++
---
```text
public ref class IFCFileModelOptions : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.IFC..::..IFCFileModelOptions
# See Also
IFCFileModelOptions Members
Autodesk.Revit.DB.IFC Namespace